7767517
328 396
Input                    in0                      0 1 in0
Convolution              conv_0                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_108                 1 1 1 2
Convolution              conv_1                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_109                 1 1 3 4
Convolution              conv_2                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_110                 1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_3                   1 1 11 12 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_111                 1 1 12 13
Convolution              conv_4                   1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Split                    splitncnn_1              1 2 14 15 16
Sigmoid                  sigmoid_95               1 1 16 17
BinaryOp                 mul_0                    2 1 15 17 18 0=2
BinaryOp                 add_1                    2 1 10 18 19 0=0
Concat                   cat_0                    3 1 7 9 19 20 0=0
Convolution              conv_5                   1 1 20 21 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Swish                    silu_112                 1 1 21 22
Convolution              conv_6                   1 1 22 23 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_113                 1 1 23 24
Convolution              conv_7                   1 1 24 25 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_114                 1 1 25 26
Slice                    split_1                  1 2 26 27 28 -23300=2,32,32 1=0
Split                    splitncnn_2              1 3 28 29 30 31
Convolution              conv_8                   1 1 31 32 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_115                 1 1 32 33
Convolution              conv_9                   1 1 33 34 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Split                    splitncnn_3              1 2 34 35 36
Sigmoid                  sigmoid_96               1 1 36 37
BinaryOp                 mul_2                    2 1 35 37 38 0=2
BinaryOp                 add_3                    2 1 30 38 39 0=0
Concat                   cat_1                    3 1 27 29 39 40 0=0
Convolution              conv_10                  1 1 40 41 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_116                 1 1 41 42
Split                    splitncnn_4              1 2 42 43 44
Convolution              conv_11                  1 1 44 45 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_117                 1 1 45 46
Convolution              conv_12                  1 1 46 47 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_118                 1 1 47 48
Slice                    split_2                  1 2 48 49 50 -23300=2,64,64 1=0
Split                    splitncnn_5              1 3 50 51 52 53
Convolution              conv_13                  1 1 53 54 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_14                  1 1 52 55 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_119                 1 1 54 56
Split                    splitncnn_6              1 2 56 57 58
Swish                    silu_120                 1 1 55 59
Convolution              conv_15                  1 1 58 60 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_121                 1 1 60 61
Convolution              conv_16                  1 1 61 62 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_7              1 2 62 63 64
Sigmoid                  sigmoid_97               1 1 64 65
BinaryOp                 mul_4                    2 1 63 65 66 0=2
BinaryOp                 add_5                    2 1 57 66 67 0=0
Split                    splitncnn_8              1 2 67 68 69
Convolution              conv_17                  1 1 69 70 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_122                 1 1 70 71
Convolution              conv_18                  1 1 71 72 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_9              1 2 72 73 74
Sigmoid                  sigmoid_98               1 1 74 75
BinaryOp                 mul_6                    2 1 73 75 76 0=2
BinaryOp                 add_7                    2 1 68 76 77 0=0
Concat                   cat_2                    2 1 77 59 78 0=0
Convolution              conv_19                  1 1 78 79 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_123                 1 1 79 80
Concat                   cat_3                    3 1 49 51 80 81 0=0
Convolution              conv_20                  1 1 81 82 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_124                 1 1 82 83
Split                    splitncnn_10             1 2 83 84 85
Convolution              conv_21                  1 1 85 86 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_125                 1 1 86 87
Convolution              conv_22                  1 1 87 88 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_126                 1 1 88 89
Slice                    split_3                  1 2 89 90 91 -23300=2,128,128 1=0
Split                    splitncnn_11             1 3 91 92 93 94
Convolution              conv_23                  1 1 94 95 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_24                  1 1 93 96 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_127                 1 1 95 97
Split                    splitncnn_12             1 2 97 98 99
Swish                    silu_128                 1 1 96 100
Convolution              conv_25                  1 1 99 101 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_129                 1 1 101 102
Convolution              conv_26                  1 1 102 103 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_13             1 2 103 104 105
Sigmoid                  sigmoid_99               1 1 105 106
BinaryOp                 mul_8                    2 1 104 106 107 0=2
BinaryOp                 add_9                    2 1 98 107 108 0=0
Split                    splitncnn_14             1 2 108 109 110
Convolution              conv_27                  1 1 110 111 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_130                 1 1 111 112
Convolution              conv_28                  1 1 112 113 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_15             1 2 113 114 115
Sigmoid                  sigmoid_100              1 1 115 116
BinaryOp                 mul_10                   2 1 114 116 117 0=2
BinaryOp                 add_11                   2 1 109 117 118 0=0
Concat                   cat_4                    2 1 118 100 119 0=0
Convolution              conv_29                  1 1 119 120 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_131                 1 1 120 121
Concat                   cat_5                    3 1 90 92 121 122 0=0
Convolution              conv_30                  1 1 122 123 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_132                 1 1 123 124
Convolution              conv_31                  1 1 124 125 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_133                 1 1 125 126
Split                    splitncnn_16             1 2 126 127 128
Pooling                  maxpool2d_92             1 1 128 129 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_17             1 2 129 130 131
Pooling                  maxpool2d_93             1 1 131 132 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_18             1 2 132 133 134
Pooling                  maxpool2d_94             1 1 134 135 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_6                    4 1 127 130 133 135 136 0=0
Convolution              conv_32                  1 1 136 137 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_134                 1 1 137 138
Convolution              conv_33                  1 1 138 139 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_135                 1 1 139 140
Slice                    split_4                  1 2 140 141 142 -23300=2,128,128 1=0
Split                    splitncnn_19             1 2 142 143 144
Convolution              conv_34                  1 1 144 145 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  reshape_185              1 1 145 146 0=400 1=128 2=2
Slice                    split_5                  1 3 146 147 148 149 -23300=3,32,32,64 1=1
Split                    splitncnn_20             1 2 149 150 151
Permute                  permute_182              1 1 147 152 0=1
Reshape                  reshape_186              1 1 150 153 0=20 1=20 2=128
MatMul                   matmul_204               2 1 152 148 154
ConvolutionDepthWise     convdw_206               1 1 153 155 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
BinaryOp                 mul_12                   1 1 154 156 0=2 1=1 2=0.176776692
Softmax                  softmax_180              1 1 156 157 0=2 1=1
MatMul                   matmultransb_0           2 1 151 157 158 0=1
Reshape                  reshape_187              1 1 158 159 0=20 1=20 2=128
BinaryOp                 add_13                   2 1 159 155 160 0=0
Convolution              conv_35                  1 1 160 161 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_14                   2 1 143 161 162 0=0
Split                    splitncnn_21             1 2 162 163 164
Convolution              conv_36                  1 1 164 165 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_136                 1 1 165 166
Convolution              conv_37                  1 1 166 167 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_15                   2 1 163 167 168 0=0
Concat                   cat_7                    2 1 141 168 169 0=0
Convolution              conv_38                  1 1 169 170 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_137                 1 1 170 171
Split                    splitncnn_22             1 2 171 172 173
Interp                   interpolate_90           1 1 173 174 0=1 1=2.0 2=2.0 6=0
Concat                   cat_8                    2 1 174 84 175 0=0
Convolution              conv_39                  1 1 175 176 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_138                 1 1 176 177
Slice                    split_6                  1 2 177 178 179 -23300=2,64,64 1=0
Split                    splitncnn_23             1 3 179 180 181 182
Convolution              conv_40                  1 1 182 183 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_139                 1 1 183 184
Convolution              conv_41                  1 1 184 185 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Split                    splitncnn_24             1 2 185 186 187
Sigmoid                  sigmoid_101              1 1 187 188
BinaryOp                 mul_16                   2 1 186 188 189 0=2
BinaryOp                 add_17                   2 1 181 189 190 0=0
Concat                   cat_9                    3 1 178 180 190 191 0=0
Convolution              conv_42                  1 1 191 192 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_140                 1 1 192 193
Split                    splitncnn_25             1 2 193 194 195
Interp                   interpolate_91           1 1 195 196 0=1 1=2.0 2=2.0 6=0
Concat                   cat_10                   2 1 196 43 197 0=0
Convolution              conv_43                  1 1 197 198 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_141                 1 1 198 199
Slice                    split_7                  1 2 199 200 201 -23300=2,32,32 1=0
Split                    splitncnn_26             1 3 201 202 203 204
Convolution              conv_44                  1 1 204 205 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_142                 1 1 205 206
Convolution              conv_45                  1 1 206 207 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Split                    splitncnn_27             1 2 207 208 209
Sigmoid                  sigmoid_102              1 1 209 210
BinaryOp                 mul_18                   2 1 208 210 211 0=2
BinaryOp                 add_19                   2 1 203 211 212 0=0
Concat                   cat_11                   3 1 200 202 212 213 0=0
Convolution              conv_46                  1 1 213 214 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_143                 1 1 214 215
Split                    splitncnn_28             1 4 215 216 217 218 219
Convolution              conv_47                  1 1 218 220 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Convolution              conv_48                  1 1 217 221 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
ConvolutionDepthWise     convdw_207               1 1 219 222 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              conv_49                  1 1 216 223 0=51 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=29376
Swish                    silu_144                 1 1 220 224
Swish                    silu_145                 1 1 221 225
Swish                    silu_146                 1 1 222 226
Swish                    silu_147                 1 1 223 227
Concat                   cat_12                   2 1 224 194 228 0=0
Convolution              conv_50                  1 1 225 229 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_51                  1 1 226 230 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_52                  1 1 227 231 0=51 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=23409
Convolution              conv_53                  1 1 228 232 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_148                 1 1 229 233
Swish                    silu_149                 1 1 230 234
Swish                    silu_150                 1 1 231 235
Swish                    silu_151                 1 1 232 236
Convolution              conv_54                  1 1 233 237 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_208               1 1 234 238 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              conv_55                  1 1 235 239 0=51 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2601
Slice                    split_8                  1 2 236 240 241 -23300=2,64,64 1=0
Split                    splitncnn_29             1 3 241 242 243 244
Reshape                  reshape_188              1 1 237 245 0=6400 1=64
Reshape                  reshape_189              1 1 239 246 0=6400 1=51
Convolution              conv_56                  1 1 244 247 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_152                 1 1 238 248
Convolution              conv_57                  1 1 248 249 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_153                 1 1 247 250
Convolution              conv_58                  1 1 250 251 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Split                    splitncnn_30             1 2 251 252 253
Swish                    silu_154                 1 1 249 254
Sigmoid                  sigmoid_103              1 1 253 255
Convolution              conv_59                  1 1 254 256 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_190              1 1 256 257 0=6400 1=1
BinaryOp                 mul_20                   2 1 252 255 258 0=2
BinaryOp                 add_21                   2 1 243 258 259 0=0
Concat                   cat_13                   3 1 240 242 259 260 0=0
Convolution              conv_60                  1 1 260 261 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_155                 1 1 261 262
Split                    splitncnn_31             1 4 262 263 264 265 266
Convolution              conv_61                  1 1 265 267 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Convolution              conv_62                  1 1 264 268 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
ConvolutionDepthWise     convdw_209               1 1 266 269 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              conv_63                  1 1 263 270 0=51 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=58752
Swish                    silu_156                 1 1 267 271
Swish                    silu_157                 1 1 268 272
Swish                    silu_158                 1 1 269 273
Swish                    silu_159                 1 1 270 274
Concat                   cat_14                   2 1 271 172 275 0=0
Convolution              conv_64                  1 1 272 276 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_65                  1 1 273 277 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_66                  1 1 274 278 0=51 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=23409
Convolution              conv_67                  1 1 275 279 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_160                 1 1 276 280
Swish                    silu_161                 1 1 277 281
Swish                    silu_162                 1 1 278 282
Swish                    silu_163                 1 1 279 283
Convolution              conv_68                  1 1 280 284 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_210               1 1 281 285 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              conv_69                  1 1 282 286 0=51 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2601
Slice                    split_9                  1 2 283 287 288 -23300=2,128,128 1=0
Split                    splitncnn_32             1 3 288 289 290 291
Reshape                  reshape_191              1 1 284 292 0=1600 1=64
Reshape                  reshape_192              1 1 286 293 0=1600 1=51
Convolution              conv_70                  1 1 291 294 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_71                  1 1 290 295 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_164                 1 1 285 296
Convolution              conv_72                  1 1 296 297 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_165                 1 1 294 298
Split                    splitncnn_33             1 2 298 299 300
Swish                    silu_166                 1 1 295 301
Convolution              conv_73                  1 1 300 302 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_167                 1 1 297 303
Convolution              conv_74                  1 1 303 304 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Swish                    silu_168                 1 1 302 305
Reshape                  reshape_193              1 1 304 306 0=1600 1=1
Convolution              conv_75                  1 1 305 307 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_34             1 2 307 308 309
Sigmoid                  sigmoid_104              1 1 309 310
BinaryOp                 mul_22                   2 1 308 310 311 0=2
BinaryOp                 add_23                   2 1 299 311 312 0=0
Split                    splitncnn_35             1 2 312 313 314
Convolution              conv_76                  1 1 314 315 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_169                 1 1 315 316
Convolution              conv_77                  1 1 316 317 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_36             1 2 317 318 319
Sigmoid                  sigmoid_105              1 1 319 320
BinaryOp                 mul_24                   2 1 318 320 321 0=2
BinaryOp                 add_25                   2 1 313 321 322 0=0
Concat                   cat_15                   2 1 322 301 323 0=0
Convolution              conv_78                  1 1 323 324 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_170                 1 1 324 325
Concat                   cat_16                   3 1 287 289 325 326 0=0
Convolution              conv_79                  1 1 326 327 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_171                 1 1 327 328
Split                    splitncnn_37             1 3 328 329 330 331
Convolution              conv_80                  1 1 330 332 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
ConvolutionDepthWise     convdw_211               1 1 331 333 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Convolution              conv_81                  1 1 329 334 0=51 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=117504
Swish                    silu_172                 1 1 332 335
Swish                    silu_173                 1 1 333 336
Swish                    silu_174                 1 1 334 337
Convolution              conv_82                  1 1 335 338 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_83                  1 1 336 339 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Convolution              conv_84                  1 1 337 340 0=51 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=23409
Swish                    silu_175                 1 1 338 341
Swish                    silu_176                 1 1 339 342
Swish                    silu_177                 1 1 340 343
Convolution              conv_85                  1 1 341 344 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_212               1 1 342 345 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Convolution              conv_86                  1 1 343 346 0=51 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2601
Reshape                  reshape_194              1 1 344 347 0=400 1=64
Reshape                  reshape_195              1 1 346 348 0=400 1=51
Concat                   cat_17                   3 1 245 292 347 349 0=1
Swish                    silu_178                 1 1 345 350
Concat                   cat_18                   3 1 246 293 348 351 0=1
Convolution              conv_87                  1 1 350 352 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_196              1 1 349 353 0=8400 1=16 2=4
Reshape                  reshape_197              1 1 351 354 0=8400 1=3 2=17
Permute                  permute_184              1 1 353 355 0=2
Slice                    tensor_split_0           1 2 354 356 357 -23300=2,2,-233 1=1
Swish                    silu_179                 1 1 352 358
Softmax                  softmax_181              1 1 355 359 0=0 1=1
Sigmoid                  sigmoid_106              1 1 357 360
Convolution              conv_88                  1 1 358 361 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Convolution              conv_89                  1 1 359 362 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
MemoryData               /model.23/Constant_25_output_0 0 1 363 0=8400 1=2
Reshape                  reshape_198              1 1 361 364 0=400 1=1
Reshape                  reshape_199              1 1 362 365 0=8400 1=4
MemoryData               /model.23/Constant_26_output_0 0 1 366 0=8400
Split                    splitncnn_0              1 2 366 367 368
BinaryOp                 mul_26                   1 1 356 369 0=2 1=1 2=2.0
Reshape                  reshape_200              1 1 363 370 0=8400 1=2 2=1
BinaryOp                 add_27                   2 1 369 370 371 0=0
Reshape                  reshape_201              1 1 367 372 0=8400 1=1 2=1
BinaryOp                 mul_28                   2 1 371 372 373 0=2
Concat                   cat_19                   3 1 257 306 364 374 0=1
Concat                   cat_20                   2 1 373 360 375 0=1
Slice                    tensor_split_1           1 2 365 376 377 -23300=2,2,-233 1=0
Sigmoid                  sigmoid_107              1 1 374 378
Reshape                  reshape_202              1 1 375 379 0=8400 1=51
MemoryData               /model.23/Constant_15_output_0 0 1 380 0=8400 1=2
Split                    splitncnn_1              1 2 380 381 382
BinaryOp                 sub_29                   2 1 381 376 383 0=1
Split                    splitncnn_38             1 2 383 384 385
BinaryOp                 add_30                   2 1 382 377 386 0=0
Split                    splitncnn_39             1 2 386 387 388
BinaryOp                 sub_31                   2 1 387 384 389 0=1
BinaryOp                 add_32                   2 1 385 388 390 0=0
BinaryOp                 div_33                   1 1 390 391 0=3 1=1 2=2.0
Concat                   cat_21                   2 1 391 389 392 0=0
Reshape                  reshape_203              1 1 368 393 0=8400 1=1
BinaryOp                 mul_34                   2 1 392 393 394 0=2
Concat                   cat_22                   3 1 394 378 379 out0 0=0
